{"page":1,"limit":50,"explicit":false,"total":17,"has_more":false,"list":[{"id":"animals","name":"Animals","description":"Every species of animal video, from funny home videos of LOLcats and cute puppies, to nature TV shows. Learn about animals and their enviroments with National Geographic and more."},{"id":"auto","name":"Cars","description":"The best auto and motorsports videos. Watch dramatic racing clips and crash footage. Check out the latest cars, trucks and motorcycle models, plus parts and accessory reviews."},{"id":"people","name":"Celeb","description":"Your home for exclusive Celebrity video coverage: interviews, paparazzi, red carpet, premieres, fashion, rumors, candid and other special features on People and their lifestyle."},{"id":"fun","name":"Comedy & Entertainment","description":"Watch shows from The WB, NBC and Rooftop Comedy including Family Guy, Simpsons, SNL, and The Daily Show. Web comedy from National Lampoon, My Damn Channel, Jib Jab and more!"},{"id":"creation","name":"Creative","description":"Arts, animation, stop-motion, cartoons, and the best independent web videos and short films."},{"id":"school","name":"Education","description":"Videos about your university experience: classes, dorm life, parties, college sports and campus music. Videos from National Lampoon, Sorority Forever and Hooking Up."},{"id":"videogames","name":"Gaming","description":"The latest videos on console and PC gaming. Find reviews, walkthroughs, cheats, official game trailers and machinima. Content from IGN, Game Zombie, THe Escapist and more."},{"id":"kids","name":"Kids","description":"Watch full episodes of your favorite cartoons, movies, and kids videos for all ages."},{"id":"lifestyle","name":"Lifestyle & How-to","description":"Your video destination for design, style and DIY. Watch how-to videos from filmmaking to fashion, creative entertaining to thrifty homemaking. Videos from Gary Vaynerchuk, Threadbanger, Howcast and more."},{"id":"shortfilms","name":"Movies","description":"Shows, movies, and trailers from Hulu, The WB, Fox, HBO and more. Catch some of the hottest shows shortly after they air, plus the latest in blockbusters and independent film."},{"id":"music","name":"Music","description":"Watch music videos, concerts, and interviews from artists in every genre, from hip-hop and rock to indie and electro. Live performances, news and exclusives."},{"id":"news","name":"News","description":"News, politics, world events, pop culture, entertainment and celebrity gossip. Videos from NBC, Fox, and TVGuide. Citizen journalism and web originals from Barely Political, VBS, Young Hollywood and more."},{"id":"sport","name":"Sports","description":"Sports videos from professional, college, and classic league sports. Find football, basketball, baseball, tennis and golf videos, alongside extreme skate, snowboard, surf, ski, wrestling and combat sports clips."},{"id":"tech","name":"Tech","description":"The best science and technology news, discoveries, product reviews, and geek culture. Videos from National Geographic, Revision 3, PBS, Diagonal View, Stuff We Like, News & Encyclopedia Britannica."},{"id":"travel","name":"Travel","description":"Watch and share travel videos from around the world. Explore global destinations, new cultures, vacation spots and local attractions through video."},{"id":"tv","name":"TV","description":"Watch television shows, interviews and documentaries. Dailymotion TV has tons of channels and programs to chose from."},{"id":"webcam","name":"Webcam","description":"Upload your latest rants, raves, songs and opinions, or watch the biggest personalities on Dailymotion sound off on video."}]}